export const INTERVIEW = [
  {"question": "왜 개발자가 되고 싶으셨나요?", "answer": `원래 꿈은 광고기획자였습니다. 취향과 트렌드를 읽고 내가 만든 광고로 사람들에게 영향력을 끼치는 일을 하고 싶었습니다. 하지만 얕게나마 실무를 경험하면서 느낀 아쉬움은 광고주의 취향에 따라 좋은 기획과 나쁜 기획이 갈려지는 것이었고, 무엇보다 노력과 실력에 대한 정량적 측정이 불가능하다는 것이 아쉬웠습니다. 

  이러한 아쉬움을 품고 회사를 다니던 중, 같은 회사의 개발자분들을 보면서 개발에 관심을 갖게 되었습니다. 당시 개발자는 평생 공부해야 하는 직업이라며 만류하는 분위기였지만, 안주하지 않고 늘 공부해야 한다는 점이 제게는 엄청난 매력으로 느껴졌습니다.
  
  적성을 확인해보기 위해 이런 저런 프로그램을 만들어 보던 중, 광고회사에서 일할 때 불편했던 인스타그램의 맥 OS와 윈도우의 한글 인코딩 문제를 해결해주는 간단한 웹사이트를 만들어 광고회사에 다니는 지인들에게 공유하였습니다. 정말 간단한 코드였지만 좋아하는 지인들의 모습을 보며 개발의 성취감과 재미를 느끼게 되었고, 더 많은 사람들에게 개발의 편리함을 나눠주고자 웹 프론트엔드 개발자가 되기로 결심했습니다.`},
  {
    "question": "자신만의 강점이 무엇이라고 생각하나요?",
    "answer": `잦은 리더의 경험으로 쉽게 의견을 제시할 수 있도록 환경을 조성할 수 있으며, 이해관계가 얽힌 집단 간의 설득 및 합의점 도출을 잘해냅니다.

  이러한 강점은 연합광고잡지동아리 콤마매거진의 편집장을 맡으면서 얻을 수 있었습니다. 콤마매거진은 9년 동안 정해진 포맷에서 매 호마다 컨셉만 변화하여 이어져 왔었습니다. 저는 단순히 콘텐츠만 작성하는 것이 아닌, 모두가 함께 만드는 잡지를 바라는 마음으로 매달 전체회의를 진행하였습니다. 편안한 환경에서 의견제시를 할 수 있도록 팀 단위로 회의 안건을 결정하도록 하였고, 전체 회의에서는 발의된 안건으로 토의를 진행하며 안건을 구체화하였습니다. 그 결과 창간 이래로 내려오던 관습을 많이 바꿀 수 있었습니다. 트렌드와 니즈를 고려하여 잡지의 크기를 조정하고, 우편배송 방식을 추가하여 배송비용을 낮추는 등 잡지 판매에도 큰 도움이 되었을 뿐만 아니라 동아리원의 만족도 향상에도 큰 기여를 할 수 있었습니다.`,
  "image": "src/assets/aboutMeImages/comma.png"},
  {"question": "팀 프로젝트 경험에 대해 알려주세요.", "answer": `프로그래머스 프론트엔드 교육과정에서 백엔드를 포함한 여러 명의 개발자와 팀을 이뤄 서비스를 기획, 배포하는 협력프로젝트를 진행했었습니다. 연합동아리 회장 경험으로 일정관리나 회의 진행에 자신이 있었기에 팀장으로서 [프로젝트](https://github.com/prgrms-web-devcourse/Team_Givooni_Needit_FE)에 참여하였고, 협력프로젝트라는 책임감에 팀장이라는 부담이 더해져 폭발적으로 성장할 수 있었습니다. 

  개발환경 구성을 도맡아 리액트의 폴더구조 방식과 라이브러리를 공부하였고, 당장 서비스를 구현하기 위해서 몰랐던 기술들도 빠르게 습득하여 적용하였습니다. CORS, HTTP 상태코드에 대해서도 직접 부딪히며 배울 수 있었습니다. 교육생끼리 진행하는 프로젝트인 탓인지 잦은 오류가 있었는데, 백엔드와 서로 오류를 주고받으며 어떤 상황에서 어떤 오류가 생기는지, 왜 네트워크 지식이 중요한지 몸소 배울 수 있었습니다.
  
  프로젝트 운영 방법도 많이 배웠습니다. 프로젝트를 이끌어가기 위해 에자일 방법론, 스프린트, 스크럼을 적용하였고, 짧은 시간 내에 개발을 마치기 위해서 스프린트를 짧게 쪼개어 목표를 설정하고 목표를 이룰 수 있도록 팀원을 독려하였습니다.`,
  "image": "src/assets/aboutMeImages/needit_logo.png"},
]