export const INTERVIEW = [
  {
    "question": "왜 개발자가 되고 싶으셨나요?",
    "answer": `어렸을 적 꿈은 광고기획자였어요. 다른 사람들에게 내가 만든 작품으로 영향력을 끼치는 일을 하고 싶었어요. 그렇게 광고기획자가 되기 위해 광고를 전공하고 인턴으로서 얕게나마 실무를 경험하였는데, 광고주의 취향에 따라 좋은 기획과 나쁜 기획이 정해지는 것에 대해 아쉬움을 느꼈어요. 또, 무엇보다 노력과 실력에 대한 측정이 불가능한 것이 아쉬웠어요.

    이러한 아쉬움을 품고 회사를 다니는 데, 운 좋게도 그 회사는 개발을 함께 진행하는 회사였기 때문에 쉽게 개발자분들을 볼 수 있었어요. 바로 옆 파티션에서 개발자분들을 보다 보니 자연스럽게 개발에 관심을 갖게 되었고, 혹시 개발자로서 적성이 있진 않을까 하는 마음에 딱 두 달만 개발을 공부해보자 하며 처음 개발을 시작하게 되었어요.
    
    결론부터 말하자면 나는 천재개발자와는 거리가 멀다고 느꼈어요. 하지만 이런저런 프로그램을 만들어 보던 중, 광고회사에서 일할 때 인스타그램에서 생기는 한글 인코딩 문제로 불편했던 것이 생각나 이를 해결해주는 간단한 웹사이트를 만들어 광고회사에 다니는 지인들에게 공유했던 적이 있어요. 간단한 코드였지만, 정말 좋아하고 추켜세워주는 지인들을 보며 개발의 성취감과 재미를 느끼게 되었고, 그 일을 계기로 개발자가 되어야겠다며 확실히 마음먹게 되었어요.`},
  {
    "question": "그동안 프로젝트를 진행하면서 가장 힘들었던 점과 좋았던 점을 소개해주세요",
    "answer": `부트캠프 과정 중 진행한 최종프로젝트가 제게 가장 힘들었고, 가장 좋았던 프로젝트였습니다.

    가장 힘들었던 점은 개발을 멋있게 해내지 못하는 제 모습이 가장 힘들었습니다. 부트캠프 최종프로젝트에서 팀장으로 참여하였는데, 처음으로 프로젝트를 리드하다보니 개발경험이 있는 다른 팀장들에 비해 뒤떨어진다고 생각되었어요. 그래서 다른 팀장들처럼 멋있게 리드하는 모습을 보여주고 싶어서 다른 프로젝트들의 코드를 살펴보며 코드구조를 어떻게 설계할지 공부하고, 애자일 방법론 등을 보며 어떻게 프로젝트를 이끌어나갈지 쉬지 않고 공부했던 것 같아요.
    
    누구보다 잘하는 팀장이 되고 싶어서 정말 몸에 무리가 올 정도로 프로젝트에 집중하였는데, 아이러니하게도 이러한 점 때문에 가장 좋았던 프로젝트라고 생각돼요. 기술뿐만 아니라 프로젝트를 진행하는 방식, 개발 과정에서 생길 수 있는 트러블 등을 많이 배울 수 있었고, 무엇보다 성공적으로 프로젝트를 완성하면서 그동안 들였던 노력에 비례하는 성취감을 얻을 수 있었어요. 만약 팀장으로 참여하지 않고 쉽게 프로젝트에 참여했다면 얻을 수 없는 것들이죠.`,
    "image": "src/assets/aboutMeImages/needit_logo.png"
  },
  {
    "question": "자신만의 강점이 있다면 무엇인가요?",
    "answer": `저는 책임이 주어지면 잘 해내야  한다는 강박이 있는데요. 그 과정에서 많은 것을 배우고 좋은 결과를 얻었던 경험이 많기 때문에 여러 상황에서 리더를 자처해왔어요. 덕분에 팀원들이 쉽게 의견을 제시할 수 있도록 환경을 조성하고, 합의점을 도출하는 것을 잘해요.

    이러한 강점은 연합광고잡지동아리 콤마매거진의 편집장을 맡으면서 얻을 수 있었는데요. 9년 동안 정해진 포맷에서 잡지가 발간되다 보니 요즘 잡지와는 동떨어져 있다는 생각을 하곤 했었어요. 또한 저는 단순히 콘텐츠만 작성하는 것이 아닌, 모두가 함께 만드는 잡지를 만들고 싶은 마음으로 매달 전체회의를 진행했어요. 
    
    편안한 환경에서 의견제시를 할 수 있도록 팀 단위로 회의 안건을 결정하도록 하였고, 전체 회의에서는 발의된 안건으로 토의를 진행하며 잡지에 변화를 주기 시작했어요. 그 결과 창간 이래로 내려오던 관습을 많이 바꿀 수 있었어요. 트렌드와 니즈를 고려해서 잡지의 크기를 조정하고, 우편배송 방식을 추가하여 배송비용을 낮추는 등 잡지 판매에도 큰 도움이 되었을 뿐만 아니라 동아리원의 만족도 향상에도 큰 기여를 할 수 있었죠.
    
    개발 프로젝트에서도 제 강점이 큰 도움이 되었어요. 빠듯한 개발일정 속에서 진행하다 보니 기획에 부족한 점이 많았는데요. 스프린트가 종료될 때마다 팀원들이 느끼는 문제점, 잘한 점 등을 이야기해보며 고쳐나갔고, 프로젝트를 진행하며 생기는 의견대립을 조율해나가며 모두가 만족할 수 있는 프로젝트를 만들 수 있었습니다.`,
    "image": "src/assets/aboutMeImages/comma.png"
  },
  
  {
    "question": "좋은 개발자는 어떤 개발자라고 생각하시나요?",
    "answer": `읽기 쉬운 코드를 작성하는 개발자가 좋은 개발자라고 생각합니다. 아직 많은 코드를 접해보지는 않았지만, 다른 사람의 코드를 읽으면서 잘하는 개발자라고 느껴질 때는 최신 기술이나 어려운 기술을 사용했을 때보다 읽기 쉬운 코드를 보았을 때였어요. 또, 보기 쉬운 코드가 대체로 오류가 발생할 확률도 적고, 유지보수 측면에도 좋은 코드이더라구요. 그렇기 때문에 읽기 쉬운 코드를 작성하는 개발자가 좋은 개발자라고 생각하고, 그렇게 되기 위해 노력하고 있어요.`,
  },
  {
    "question": "10년 뒤에는 어떤 개발자가 되고 싶으신가요?",
    "answer": `10년 뒤에도 항상 새로운 기술을 궁금해하는 개발자가 되고 싶습니다. 지금은 매일 공부해야 한다는 직업에 매력을 느끼고 있지만, 10년이라는 시간 동안 개발에 흥미를 잃거나 안주할 수도 있을 것 같다는 걱정을 하고 있어요. 그래서 시니어 개발자가 된 순간에도 스터디나 지식나눔 등을 통해서 끝없이 목표를 세우고 성장하는 개발자가 되는 것이 현재 가지고 있는 개발자로서의 지향점입니다.`,
  },
]